<a href="https://colab.research.google.com/github/Shreyabansal3112/testing/blob/main/test2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data={'S':[5,2,3,4,5,6,7,5,9,1234457890083]}

In [ ]:
df=pd.DataFrame(data,columns=['S'])

In [ ]:
df

               S
0              5
1              2
2              3
3              4
4              5
5              6
6              7
7              5
8              9
9  1234457890083

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S       10 non-null     int64
dtypes: int64(1)
memory usage: 208.0 bytes

In [ ]:
df['test']=(df['S']==5).astype(np.int8)

In [ ]:
df

               S  test
0              5     1
1              2     0
2              3     0
3              4     0
4              5     1
5              6     0
6              7     0
7              5     1
8              9     0
9  1234457890083     0

In [ ]:
df['test1']=(df['S']).astype(np.int8)

In [ ]:
df

               S  test  test1
0              5     1      5
1              2     0      2
2              3     0      3
3              4     0      4
4              5     1      5
5              6     0      6
6              7     0      7
7              5     1      5
8              9     0      9
9  1234457890083     0     35